Revit 2027 API
ExportLayerInfo.RemoveLayerModifier Method
 Removes a project layer modifier from the layer info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveLayerModifier(
	LayerModifier layerModifier
)
Public Sub RemoveLayerModifier (
	layerModifier As LayerModifier
)
public:
void RemoveLayerModifier(
	LayerModifier^ layerModifier
)
member RemoveLayerModifier :
        layerModifier : LayerModifier -> unit
Parameters
layerModifier LayerModifier
 The project layer modifier.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace